Repository: selrahcsan/vscodium_backup_tool
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: es, pt_br

source: 📁 Copying settings...
es: 📁 Copiando configuraciones...
pt_br: 📁 Copiando configurações...

source: 🧩 Exporting extension list...
es: 🧩Exportando lista de extensiones...
pt_br: 🧩 Exportando lista de extensões...

source: ✅ Backup completed at: {}
es: ✅ Backup terminado en: {}
pt_br: ✅ Backup concluído em: {}

source: ❌ No backups found.
es: ❌No se encontraron backups.
pt_br: ❌ Nenhum backup encontrado.

source: 📦 Available backups:
es: 📦 Backups disponibles:
pt_br: 📦 Backups disponíveis:

source: Choose the number of the backup to restore:
es: Seleccione el número de backup restaurar:
pt_br: Escolha o número do backup para restaurar:

source: ❌ Invalid choice.
es: ❌ Elección no válida.
pt_br: ❌ Escolha inválida.

source: 🔄 Restoring configuration...
es: 🔄Restaurando configuración...
pt_br: 🔄 Restaurando configurações...

source: 📥 Reinstalling extensions...
es: 📥Reinstalando extensiones...
pt_br: 📥 Reinstalando extensões...

source: ⚠️ No extension list found.
es: ⚠️ No se encontró ninguna lista de extensiones.
pt_br: ⚠️ Nenhuma lista de extensões encontrada.

source: ✅ Restore completed!
es: ✅ ¡Restauración completada!
pt_br: ✅ Restauração concluída!

source: === VSCodium Backup Tool ===
pt_br: === Ferramenta de Backup do VSCodium ===

source: 1. Create backup
es: 1. Crear backup
pt_br: 1. Fazer backup

source: 2. Restore backup
es: 2. Restaurar backup
pt_br: 2. Restaurar backup

source: 3. Exit
es: 3. Salida
pt_br: 3. Sair

source: Choose an option:
es: Elige una opción:
pt_br: Escolha uma opção:

source: 👋 Exiting...
es: 👋 Saliendo...
pt_br: 👋 Saindo...

source: ❌ Invalid option!
es: ❌ ¡Opción inválida!
pt_br: ❌ Opção inválida!
